[
  {
    "_id": "0282e0e58a5c404fbd15261f11c2ab6b",
    "others_info": {
      "is_todays_pick": false,
      "is_trending": true
    },
    "category_id": "01",
    "rating": { "number": 4.5, "badge": "Excellent" },
    "total_view": 12488,
    "title": "Getting to know the Django web framework",
    "language": "English",
    "framework":"Django",
    "tag": "Python",
    "image_url": "https://th.bing.com/th/id/R.e2c13e3b988cff2ddeb36a756b7d800f?rik=ub7fqbPho1emnQ&pid=ImgRaw&r=0",
    "details": "Django—pronounced “Jango,” named after the famous jazz guitarist Django Reinhardt—is a free, open source framework that was first publicly released in 2005. Django facilitates “rapid development and clean, pragmatic design.” The Django web framework, deployed on a web server, can help developers quickly produce a web frontend that’s feature-rich, secure and scalable.Starting with the Django web framework is more efficient way to build a web app than starting from scratch, which requires building the backend, APIs, javascript and sitemaps. With the Django web framework, web developers can focus on creating a unique application and benefit from greater flexibility than using a web development tool."
  },
  {
    "_id": "0282e0e58a5c404fbd15261f12c2ab6b",
    "others_info": {
      "is_todays_pick": false,
      "is_trending": true
    },
    "category_id": "01",
    "rating": { "number": 4.5, "badge": "Excellent" },
    "total_view": 12488,
    "title": "Pyramid web framework",
    "language": "English",
    "framework":"Pyramid",
    "tag": "Python",
    "image_url": "https://www.mobiloitte.com/images/PV4.png",
    "details": "Pyramid makes it easy to write web applications. You can start small with this minimal request/response web app. This may take you far, especially while learning. As your application grows, Pyramid offers many features that make writing complex software take less effort.Pyramid works in all supported versions of Python. Our installation instructions will help you get Pyramid up and running.Pyramid may be extended through add-ons and development environments. The Python Package Index trove classifier is used by over 470 packages. Support may be by the Pylons Project or  by the community.All projects under the Pylons Project have 100% test coverage and 100% documentation.An  is a package which relies on Pyramid itself and extends the functionality of Pyramid, such as adding an ORM, sending email, or using a template-based language. If your add-on does not rely on Pyramid, it's not an add-on, but just a library, and it will not be listed on the Extending Pyramid page. Official Pylons Project libraries may be listed.a special category of packages which use Pyramid as a core, but offer alternative services and scaffolding to ease web application development. Some could be labeled content management system or admin interface. Development environments often have dependencies beyond those of the Pyramid core."
  },
  {
    "_id": "0282e0e58a5c404fbd15261f13c2ab6b",
    "others_info": {
      "is_todays_pick": false,
      "is_trending": true
    },
    "category_id": "01",
    "rating": { "number": 4.5, "badge": "Excellent" },
    "total_view": 12488,
    "title": "full-stack framework for rapid development",
    "language": "English",
    "framework":"Web2py",
    "tag": "Python",
    "image_url": "https://th.bing.com/th/id/OIP.KRqspdVvBMLZzf6mUT9IKQHaDn?pid=ImgDet&rs=1",
    "details": "Free open source full-stack framework for rapid development of fast, scalable, secure and portable database-driven web-based applications. Written and programmable in Python (version 3 and 2.7).The best way to understand web2py is to try it. You can try it online here (this online version is identical to the actual web2py although some functions are disabled for security reasons).web2py was inspired by Ruby on Rails and, as Rails, it focuses on rapid development and follows a Model View Controller design. web2py differs from Rails because it is based on Python (thus it is faster and more scalable), because it provides a comprehensive web-based administrative interface (thus there is no need to ever type shell commands unless you wish), includes libraries to handle more protocols (for example XML-RPC and RSS feeds), and can run on the Google App Engine.web2py was also inspired by Django and, as Django, it has the ability to generate forms from database tables and it includes an extensive set of validators. web2py differs from Django because it is more compact, easier to learn and does not have any project-level configuration files.web2py is less verbose than Java-based frameworks and its syntax is much cleaner than PHP-based frameworks. This makes applications simpler to develop, and easier to read and maintain."
  },
  {
    "_id": "0282e0e58a5c404fbd15261f14c2ab6b",
    "others_info": {
      "is_todays_pick": false,
      "is_trending": true
    },
    "category_id": "02",
    "rating": { "number": 4.5, "badge": "Excellent" },
    "total_view": 12488,
    "title": "Spring Tutorial",
    "language": "English",
    "framework":"Spring",
    "tag": "Java",
    "image_url": "https://sharryhong.github.io/image/spring.png",
    "details": "This spring tutorial provides in-depth concepts of Spring Framework with simplified examples. It was developed by Rod Johnson in 2003. Spring framework makes the easy development of JavaEE application.Spring is a lightweight framework. It can be thought of as a framework of frameworks because it provides support to various frameworks such as Struts, Hibernate, Tapestry, EJB, JSF, etc. The framework, in broader sense, can be defined as a structure where we find solution of the various technical problems.The Spring framework comprises several modules such as IOC, AOP, DAO, Context, ORM, WEB MVC etc. We will learn these modules in next page. Let's understand the IOC and Dependency Injection first."
  },
  {
    "_id": "0282e0e58a5c404fbd15261f15c2ab6b",
    "others_info": {
      "is_todays_pick": false,
      "is_trending": true
    },
    "category_id": "02",
    "rating": { "number": 4.5, "badge": "Excellent" },
    "total_view": 12488,
    "title": "Hibernate Tutorial",
    "language": "English",
    "framework":"Hibernate",
    "tag": "Java",
    "image_url": "https://3.bp.blogspot.com/-nAzos7rPamc/W9mPuMQBdSI/AAAAAAAAOCw/wewdun03hyIwQd0MFWcFDPHm4wh8ROmtQCLcBGAs/s1600/hibernate.png",
    "details": "This hibernate tutorial provides in-depth concepts of Hibernate Framework with simplified examples. It was started in 2001 by Gavin King as an alternative to EJB2 style entity bean.Hibernate is a Java framework that simplifies the development of Java application to interact with the database. It is an open source, lightweight, ORM (Object Relational Mapping) tool. Hibernate implements the specifications of JPA (Java Persistence API) for data persistence."
  },
  {
    "_id": "0282e0e58a5c404fbd15261f16c2ab6b",
    "others_info": {
      "is_todays_pick": false,
      "is_trending": true
    },
    "category_id": "02",
    "rating": { "number": 4.5, "badge": "Excellent" },
    "total_view": 12488,
    "title": "GWT(Google Web Toolkit) Framework",
    "language": "English",
    "framework":"GWT",
    "tag": "Java",
    "image_url": "https://th.bing.com/th/id/R.d13082c571dad5522ca1322b43d4a5b1?rik=HUYUxDoDooFXQg&pid=ImgRaw&r=0",
    "details": "GWT Tutorial provides basic and advanced concepts of GWT. Our GWT Tutorial is designed for beginners and professionals both.GWT is a development toolkit which enables developers to develop internet application. GWT emphasise on reusable approaches to common web-app tasks such as bookmarking, UI abstraction, cross-browser portability etc.Our GWT Tutorial includes all topics of GWT Tutorial such as GWT Tutorial with introduction, installation, first gwt application, create application, point class, deployment descriptor, rpc, rpc mechanism, panels, layout panels, ui blinder, stock exchange app example, testing, running unit, writing unit etc."
  },
  {
    "_id": "0282e0e58a5c404fbd15261f17c2ab6b",
    "others_info": {
      "is_todays_pick": false,
      "is_trending": true
    },
    "category_id": "03",
    "rating": { "number": 4.5, "badge": "Excellent" },
    "total_view": 12488,
    "title": "Beakr Tutorial",
    "language": "English",
    "framework":"Beakr",
    "tag": "R",
    "image_url": "https://th.bing.com/th/id/R.67721677de1d6a4f891339a767d3f20b?rik=phrpNjBJbkYSkA&riu=http%3a%2f%2fasia.iza-structure.org%2fIZA-SC%2fFWmain_images%2fBEC_001.jpg&ehk=QoPFekmf6FQbWgKBZJcu4MCmPRiOvqfPk%2byJl7di%2fwY%3d&risl=&pid=ImgRaw&r=0",
    "details": "Having recently announced the beakr web framework for R, we have received several questions about context and why we choose beakr over other options for some of our web services. This post will attempt to answer some of those questions by providing a few opinions on beakr and other web frameworks for R.The comparison will by no means be exhaustive but will attempt to briefly summarize some of the key distinctions each web framework has to offer. While there are some differences in the approach each package takes to developing web services, they all share similar basic functionality. In the end, the choice of a particular framework will come down largely to personal preference."
  },
  {
    "_id": "0282e0e58a5c404fbd15261f18c2ab6b",
    "others_info": {
      "is_todays_pick": false,
      "is_trending": true
    },
    "category_id": "04",
    "rating": { "number": 4.5, "badge": "Excellent" },
    "total_view": 12488,
    "title": "React Tutorial",
    "language": "English",
    "framework":"React",
    "tag": "Javascript",
    "image_url": "https://th.bing.com/th/id/R.f81a6f373c244b1f70f4b7402b5ab372?rik=rbXh4ieLuKt%2bmA&riu=http%3a%2f%2flogos-download.com%2fwp-content%2fuploads%2f2016%2f09%2fReact_logo_logotype_emblem.png&ehk=QhGOkKcUKCU7FBQgHOajOiJqJBACUTD2Ni6LsfqzCEA%3d&risl=&pid=ImgRaw&r=0",
    "details": "React makes it painless to create interactive UIs. Design simple views for each state in your application, and React will efficiently update and render just the right components when your data changes.Declarative views make your code more predictable and easier to debug."
  },
  {
    "_id": "0282e0e58a5c404fbd15261f19c2ab6b",
    "others_info": {
      "is_todays_pick": false,
      "is_trending": true
    },
    "category_id": "05",
    "rating": { "number": 4.5, "badge": "Excellent" },
    "total_view": 12488,
    "title": "Kigs Tutorial",
    "language": "English",
    "framework":"Kigs",
    "tag": "C++",
    "image_url": "https://kigs.hypotheses.org/files/2020/03/Bild1.png",
    "details": " A free and open source C++ modular multi-purpose cross platform RAD framework. [MIT] website libPhenom - libPhenom is an eventing framework for building high performance and high scalability systems in C. [Apache2] LibSourcey - C++11 evented IO for real-time video streaming and high performance networking applications. [LGPL]."
  },
  {
    "_id": "0282e0e58a5c404fbd15261f20c2ab6b",
    "others_info": {
      "is_todays_pick": false,
      "is_trending": true
    },
    "category_id": "06",
    "rating": { "number": 4.5, "badge": "Excellent" },
    "total_view": 12488,
    "title": "Godot Engine",
    "language": "English",
    "framework":"Godot",
    "tag": "Lua",
    "image_url": "https://library.kissclipart.com/20181219/xgw/kissclipart-godot-clipart-godot-game-engine-blender-36ee1a69d592d485.png",
    "details": "Godot Engine is a feature-packed, cross-platform game engine to create 2D and 3D games from a unified interface. It provides a comprehensive set of common tools, so that users can focus on making games without having to reinvent the wheel. Games can be exported with one click to a number of platforms, including the major desktop platforms (Linux, macOS, Windows), mobile platforms (Android, iOS), as well as Web-based platforms (HTML5) and consoles."
  }
]